# pandas tutorial
                         panda is an open source , BSD-licensed library providing high performance ,easy to use data structure and data analysis tools for the pythion programming language.

### agenda
     what is data frames?
     what is data series?
     different operation in pandas?

In [6]:
import pandas as pd
import numpy as np

In [14]:
# palying with dataframe
df=pd.DataFrame(np.arange(70,90).reshape(5,4),index=['manish','aniket','shasi','romil','prabhat'],columns=['physics','maths','chemistry','hindi'])

In [20]:
#converting intp excel file
df.to_csv('result.csv')

In [21]:
#accessing the elememts
#1. .loc -- here u will be focusing on ur row index
#2. .iloc -- here u will  be focusing on row and coloumn both

In [22]:
df.loc['manish']

physics      70
maths        71
chemistry    72
hindi        73
Name: manish, dtype: int32

In [6]:
df.loc['aniket']

physics      74
maths        75
chemistry    76
hindi        77
Name: aniket, dtype: int32

In [9]:
type(df.loc['manish'])

pandas.core.series.Series

In [10]:
df.iloc[:,:]

         physics  maths  chemistry  hindi
manish        70     71         72     73
aniket        74     75         76     77
shasi         78     79         80     81
romil         82     83         84     85
prabhat       86     87         88     89

In [44]:
df.iloc[0:2,0:2]

        physics  maths
manish       70     71
aniket       74     75

In [45]:
df.iloc[2:4,1:3]

       maths  chemistry
shasi     79         80
romil     83         84

In [46]:
type(df.iloc[2:4,1:3])

pandas.core.frame.DataFrame

In [47]:
df.iloc[0:1,0:1]

        physics
manish       70

In [48]:
type(df.iloc[0:1,0:1])

pandas.core.frame.DataFrame

In [49]:
df.iloc[0:2,0]

manish    70
aniket    74
Name: physics, dtype: int32

In [51]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [11]:
# convert DataFrame unto arrays
df.iloc[:,:].values

array([[70, 71, 72, 73],
       [74, 75, 76, 77],
       [78, 79, 80, 81],
       [82, 83, 84, 85],
       [86, 87, 88, 89]])

In [12]:
df.iloc[:,:].values.shape

(5, 4)

In [13]:
df.isnull().sum()

physics      0
maths        0
chemistry    0
hindi        0
dtype: int64

In [56]:
df['physics'].value_counts()

74    1
78    1
82    1
70    1
86    1
Name: physics, dtype: int64

In [14]:
df['maths'].value_counts()

83    1
79    1
75    1
87    1
71    1
Name: maths, dtype: int64

In [15]:
df['maths'].unique()

array([71, 75, 79, 83, 87])

In [16]:
df['maths'].unique

<bound method Series.unique of manish     71
aniket     75
shasi      79
romil      83
prabhat    87
Name: maths, dtype: int32>

In [17]:
df['maths']

manish     71
aniket     75
shasi      79
romil      83
prabhat    87
Name: maths, dtype: int32

In [67]:
df['physics']

manish     70
aniket     74
shasi      78
romil      82
prabhat    86
Name: physics, dtype: int32

In [69]:
df[['physics','maths']]

         physics  maths
manish        70     71
aniket        74     75
shasi         78     79
romil         82     83
prabhat       86     87

In [70]:
df[['chemistry','maths']]

         chemistry  maths
manish          72     71
aniket          76     75
shasi           80     79
romil           84     83
prabhat         88     87